- Data Storytelling 

- Story telling - making a story - because

Run any language, we needed an IDE

- https://sqliteonline.com/

In [ ]:
-- query, database, table

In SQL every row is called a record. 

- Create a databases
- create tables
- query databases and tables
- create views, view a part of the database

1. Query a database 
    - can manipulate data within a database
    - create, or retrieve data from a database

2. CRUD operations on Records
    - Create 
    - Read
    - Update
    - Delete

In [ ]:
SELECT * FROM Departments

- SELECT - extract data from a database
- INSERT INTO 
- CREATE DATABASE
-

- Run SQL in a python based version, called SQLite

```sql
CREATE TABLE Department(   -- create table -> create a new table   -- Specify name
  id      INT PRIMARY KEY,  -- created a new column, assigned INTEGER data type to it, -- added a constraint (rule or a property)
  name    VARCHAR(50)
)
```

- PRIMARY KEY columns, won't allow duplicates 
- VARCHAR - in sql is a data type - think of it like, string in python 
- You specify how many bytes to assign as well
-

```sql

CREATE TABLE Department(
  id      INT PRIMARY KEY,
  name    VARCHAR(50)
);

CREATE TABLE Employees(
  id      INT PRIMARY KEY,
  name    VARCHAR(50),
  department_id INT,
  salary INT,
  city VARCHAR(50),
  hiring_year INT,
  FOREIGN KEY (department_id) REFERENCES departments(id)
);

SELECT name, id FROM Department;

-- insert some data into the tables
INSERT INTO Department (id, name) VALUES ( 1, 'Computer Science'),(2, 'Maths'),(3, 'Physics');

- In SQL case does not matter

- Spaces do not matter

- terminator is required ;

-

#### Learning about selections

In [1]:
-- selection 
-- WHERE clause 

-- let's us keep rows that meet certain conditions

SELECT * from Employees;

SELECT name, salary, city, hiring_year FROM Employees WHERE city = 'New York';

-- get the employees with salary greater that 80K 

SELECT name, salary, city, hiring_year 
FROM Employees 
WHERE salary > 60000 AND city = 'Chicago' AND hiring_year = 2018;

-- AND OR 

-- USing IN 
SELECT name, salary, city, hiring_year 
FROM employees
WHERE city IN ('New York', 'Chicago');

-- USing between 
SELECT name, salary, city, hiring_year 
FROM employees
WHERE salary BETWEEN 60000 AND 800000

SyntaxError: unterminated string literal (detected at line 4) (4229551976.py, line 4)

#### Soring with order

In [ ]:
SELECT name, salary
FROM employees
ORDER BY salary ASC; -- (for acending)  -- DESC for decending

In [ ]:
-- selection 
-- WHERE clause 

-- let's us keep rows that meet certain conditions

SELECT * from Employees
LIMIT 3;


SELECT name, salary, city, hiring_year FROM Employees WHERE city = 'New York';

-- get the employees with salary greater that 80K 

SELECT name, salary, city, hiring_year 
FROM Employees 
WHERE salary > 60000 AND city = 'Chicago' AND hiring_year = 2018;

-- AND OR 

-- USing IN 


SELECT name, salary, city, hiring_year 
FROM employees
WHERE salary BETWEEN 60000 AND 800000
ORDER By hiring_year DESC; 


SELECT name, salary, city 
FROM Employees
ORDER BY city ASC, salary DESC
LIMIT 5;

SELECT name, salary, salary / 12 AS monthly_salary
FROM employees;

SELECT * FROM Employees;

-- UPDATE things using SQL 
-- UPDATE the table, with a new column

-- Add a new column to employees 

ALTER TABLE Employees
ADD COLUMN monthly_salary REAL;

UPDATE Employees 
SET monthly_salary = salary / 12

1. Write a SQL statement to create the employees table with the columns:

    - emp_id (integer, primary key)

    - name (text, not null)

    - department (text, not null)

    - salary (integer)

    - city (text)

2. Write INSERT statements to add at least 5 employees into the employees table with different departments, salaries, and cities.

3. Write a query to show all columns for all employees in the table.

4. Write a query to show only the name and salary of all employees.

5. Write a query to show all employees who work in the **Engineering** department.

6. Write a query to show all employees whose salary is greater than 50,000.

7. Write a query to show all employees who live in the city Mumbai.

8. Write a query to list all employees ordered by salary from highest to lowest.

9. Write a query to list all employees ordered by name in Aâ€“Z order.

10. Write a query to show the name, salary, and a calculated column called monthly_salary which is salary / 12.

11. Write an ALTER TABLE statement to add a new column called monthly_salary to the employees table.

12. Write an UPDATE statement to fill the monthly_salary column for all employees so that:
monthly_salary = salary / 12.

13. Add another calculated column, salary_next_year, such that, the current salary has been increased by 9%
    - Salary + 0.09 * Salary = salary_next_year


After updating, write a query to show name, salary, and monthly_salary for all employees to verify the update.

In [2]:
import sqlite3 as sql

In [3]:
connection = sql.connect('test.db')
cursor = connection.cursor()

In [4]:
cursor.execute('''
CREATE TABLE students(

    id INT PRIMARY KEY,
    name VARCHAR(10),
    city VARCHAR(10),
    hobby VARCHAR(10)
)
''')

In [5]:
connection.commit()

In [6]:
cursor.execute(
    "INSERT INTO students (id,name,city,hobby) VALUES (1, 'Hazirah','Seremban','Playing Computer Games')"
)

In [7]:
cursor.execute("SELECT * FROM students")
results = cursor.fetchall()
results

[(1, 'Hazirah', 'Seremban', 'Playing Computer Games')]

In [8]:
cursor.execute(
    "INSERT INTO students (id,name,city,hobby) VALUES (2, 'Syaza','Kulai','Reading Article')"
)

In [28]:

#Prepare the SQL query with placeholders
sql = "INSERT INTO students (id, name, city, hobby) VALUES (?, ?, ?, ?)"

#Create a list of tuples with data
students_data = [
    (4, 'Syaza', 'Kulai', 'Reading Article'),
    (5, 'Ali', 'Johor Bahru', 'Football'),
    (6, 'Mei Ling', 'Ipoh', 'Painting'),
    (7, 'Raj', 'Klang', 'Cooking')
]


cursor.executemany(sql, students_data)

In [29]:
cursor.execute("SELECT * FROM students")
results = cursor.fetchall()
results

[(1, 'Hazirah', 'Seremban', 'Playing Computer Games'),
 (2, 'Syaza', 'Kulai', 'Reading Article'),
 (4, 'Syaza', 'Kulai', 'Reading Article'),
 (5, 'Ali', 'Johor Bahru', 'Football'),
 (6, 'Mei Ling', 'Ipoh', 'Painting'),
 (7, 'Raj', 'Klang', 'Cooking')]

In [9]:
cursor.execute("SELECT * FROM students")
results = cursor.fetchall()
results

[(1, 'Hazirah', 'Seremban', 'Playing Computer Games'),
 (2, 'Syaza', 'Kulai', 'Reading Article')]